EDT/УТ/src/Documents/РасчетПоДоговорамГПХ/РасчетПоДоговорамГПХ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасчетПоДоговорамГПХ</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеПериода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоговорыГПХ</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаказов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДФЛ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/СводПоЗарплате/СводПоЗарплате.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СводПоЗарплате</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоказательКоличества</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Корректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЮрЛицо</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипРасчетаЗарплаты</name>
    <type>
      <types>EnumRef.ТипыРасчетаЗарплаты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УчастникЭкипажа</name>
    <type>
      <types>EnumRef.УчастникЭкипажа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.ПоказателиРасчетаУслугСД</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипНУ</name>
    <type>
      <types>EnumRef.ТипыНУЭкипажей</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Catalogs/КонтактныеЛицаКонтрагентов/КонтактныеЛицаКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтактныеЛицаКонтрагентов</name>
  <comment>Контактные лица контрагентов</comment>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>РольКонтактногоЛица</name>
    <type>
      <types>CatalogRef.РолиКонтактныхЛиц</types>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/Documents/РасчетПоДоговорамГПХ/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ЗаполнитьНаСервере()
	Для каждого Сотрудник Из Объект.ДоговорыГПХ Цикл
		Количество = ПолучитьКоличествоЗаказов(Сотрудник.Сотрудник);	
		Сотрудник.КоличествоЗаказов = Количество;
		Сотрудник.Сумма = Количество * Объект.Ставка;
		Сотрудник.СуммаНДФЛ = Сотрудник.Сумма * 0.13;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоЗаказов(Сотрудник)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СводПоЗарплатеОбороты.ПоказательКоличестваОборот КАК Доставка,
		|	СводПоЗарплатеОбороты.ФизЛицо КАК ФизЛицо
		|ИЗ
		|	РегистрНакопления.СводПоЗарплате.Обороты(&ДатаНач, &ДатаКон, , ) КАК СводПоЗарплатеОбороты
		|ГДЕ
		|	СводПоЗарплатеОбороты.ФизЛицо = &ФизЛицо";
	
	Запрос.УстановитьПараметр("ДатаКон", КонецДня(Объект.ОкончаниеПериода));
	Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("ФизЛицо", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
		Возврат РезультатЗапроса.Доставка;
	КонецЦикла;
	Сообщить("Для " + Сотрудник + " нет записей в отчетный период");
	Возврат 0;
КонецФункции

&НаСервере
Функция СформироватьБланки()
	Отбор = Новый Структура;
	Отбор.Вставить("Печать", Истина);
	ВрТаб = Объект.ДоговорыГПХ.Выгрузить(Отбор);
	Если ВрТаб.Количество() = 0 Тогда
		ВрТаб = Объект.ДоговорыГПХ;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	Макет = Документы.РасчетПоДоговорамГПХ.ПолучитьМакет("Макет");
	Область = Макет.ПолучитьОбласть("Шапка");
	Для Каждого ТекСтр Из ВрТаб Цикл
		Область.Параметры.Дата = ФорматДаты(Объект.ОкончаниеПериода);
		Область.Параметры.Компания = ТекСтр.Контрагент;
		Область.Параметры.НомерДог = ТекСтр.Договор.Номер;
		Область.Параметры.ДатаДог = ФорматДаты(ТекСтр.Договор.Дата);
		Область.Параметры.ГенДир = НайтиГенДир(ТекСтр.Контрагент);
		Область.Параметры.ФИО = ТекСтр.Сотрудник;
		Область.Параметры.ДатаНачало = ФорматДаты(Объект.НачалоПериода);
		Область.Параметры.ДатаКонец = ФорматДаты(Объект.ОкончаниеПериода);
		Область.Параметры.Сумма = ТекСтр.Сумма;
		Область.Параметры.СуммаПрописью = ЧислоПрописью(ТекСтр.Сумма, "Л=ru_RU;ДП=Истина;НП=Истина", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж");
		Проп = ЧислоПрописью(Окр(ТекСтр.СуммаНДФЛ,0), "Л=ru_RU;НП=Истина", "рубль, рубля, рублей, , , , , 0");
		Область.Параметры.НДФЛПрописью = Лев(Проп,СтрДлина(Проп)- 4);
		ТабДок.Вывести(Область);
		
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();

	КонецЦикла;
	
	Возврат ТабДок;	
КонецФункции

&НаСервере
Функция ФорматДаты(Дата)
	Стр = СтрЗаменить(Формат(Дата, "ДФ=dd_.MMMM.yyyy"),"."," ");
	Если Стр <> "" Тогда
		Стр = СтрЗаменить(Стр,"_","»");
		Стр = "«" + Стр;
	КонецЕсли;	
	Возврат Стр;	
КонецФункции

&НаСервере
Функция НайтиГенДир(Владелец)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтактныеЛицаКонтрагентов.КонтактноеЛицо КАК КонтактноеЛицо
		|ИЗ
		|	Справочник.КонтактныеЛицаКонтрагентов КАК КонтактныеЛицаКонтрагентов
		|ГДЕ
		|	КонтактныеЛицаКонтрагентов.Владелец = &Владелец
		|	И КонтактныеЛицаКонтрагентов.РольКонтактногоЛица = &РольКонтактногоЛица
		|	И КонтактныеЛицаКонтрагентов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("РольКонтактногоЛица", Справочники.РолиКонтактныхЛиц.Гендиректор);
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.КонтактноеЛицо;
	КонецЦикла;	
	Возврат "";	
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	ТабДок = СформироватьБланки();
	ТабДок.АвтоМасштаб = Истина;	
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
КонецПроцедуры

&НаКлиенте
Процедура УбратьГалочки(Команда)
	Для каждого Стр из Объект.ДоговорыГПХ Цикл
		Стр.Печать = Ложь;
	КонецЦикла;
КонецПроцедуры
